{
   "response":{
      "value":{
         "ALL_RECORDS":[
            {
               "SECTOR_DESC":"Technology",
               "REPORT_TYPE_NAME":"Company Note",
               "REP_DESC":"In-line 2Q20 core net profit - HUMAN reported a 2Q20 net profit of THB34m (-6.5% yoy, -31.8% qoq). Excluding one-time expenses (FX losses, net losses on financial investment, provision for bad debt worth a combined THB7m), 2Q20 core net profit was THB40m (+1.7% yoy, -9.3% qoq) on the back of THB173m revenue (+24.5% yoy, -0.5% qoq); the strong yoy revenue increase is due to the acquisition of Tiger Soft in 3Q19. 2Q20 core net profit was in-line, as higher-than-expected revenue offset the negative impact of the higher-than-expected SG&amp;A. There is no Bloomberg consensus estimate for 2Q20 net profit. 1H20 core net profit accounted for 51.7% of our previous full-year forecast.Tiger Soft helped support 2Q20 revenue - Service revenue beat our forecast by 3.6% in 2Q20 thanks to the higher-than-expected hardware sales of THB21m (+50% qoq); HUMAN started offering bundled solutions (Tiger Soft&#8217;s hardware that sychronises data to software) to clients, and the increase in hardware sales in 2Q20 was from time-attendance devices featuring facial recognition and body-temperature checks.Cut FY20-21F core net profit by 4-5% - The stronger revenue trend in 2Q20 leads us to raise our FY20-22F revenue by c.3%. However, we also raise SG&amp;A expenses by 15-17%, leading us to cut FY20-22F core net profit by 5-6%; 2Q20 normalised SG&amp;A was THB34m, 19% higher than our estimate. Our new FY20F forecasts represent 11.8%/1.9% increases in revenue/core net profit. 1H20 core net profit accounts for 55.1% of our new full-year forecast; we expect 2H20F performance to be weaker than 1H20, as some of HUMAN&#8217;s clients in food-and-beverage and tourism industries should continue laying off clients.Reiterate Add; we expect revenue recovery to start in FY21F - We expect waves of employee layoffs by HUMAN&#8217;s clients to be completed by the end of FY20F, and revenue improvement should start in FY21F. In addition to the recovery of the existing business, revenue recognition from new businesses (not factored in our model yet) such as flexi-benefit platform and peer-to-peer lending could act as re-rating catalysts. We reiterate our Add call with a DCF-based TP of THB9.30 (WACC: 6.4%, LTG: 3.0%). The decrease in target price is due to the earnings cuts. Downside risks include worse-than-expected impact of Covid-19 outbreak on clients&#8217; businesses and headcount.",
               "ABOUT":"CIBC is partnering with Malaysian-headquartered CIMB to provide exclusive Canadian distribution for its Asian equity research. CIMB provides equity research across ten markets including Malaysia, Singapore, Indonesia, Thailand, Hong Kong/China, Taiwan, South Korea, India and Vietnam. Through joint ventures, CIMB also publishes equity research covering Philippines and Sri Lanka. Below is the latest daily publishing summary for CIMB reports. In the coming months, CIBC will provide entitled clients even more access to CIMB research.",
               "TARGET_NAME":"",
               "PRIMARY_TICKER_ID":"",
               "COMPANY_NAME":"",
               "REP_TYPE_TOOLTIP":"Company Note",
               "VENDOR_ID":"1122",
               "ICON":"BLUE",
               "REP_PUBLICATION_ID":"3302B2B5-3C44-4CE8-B415-B61C787DFC56",
               "TICKER":"",
               "MULTI_IND_NAME":"Technology",
               "ANALYST_ID_LIST":"",
               "REP_TYPE_NAME":"Company Note",
               "REP_TITLE":"TH: Humanica - Lacklustre outlook in 2H20F",
               "REP_ANALYST_ID":"",
               "REP_ANALYST_FULL_NAME":"",
               "LEGEND_IMG_PATH":"cibc/images/Company.gif",
               "REPORT_GROUP":"F",
               "REP_ANA_NAME":"",
               "INDUSTRY_ID":"",
               "IND_NAME":"",
               "SECTOR_ID":"427021",
               "ANALYST_LIST":[

               ],
               "MUL_TIC_MULTI_IND_SECTOR_NAME":"",
               "REP_TITLE_TOOLTIP":"TH: Humanica - Lacklustre outlook in 2H20F",
               "MULTI_IND_MULTI_SECTOR":"",
               "REPORT_TYPE_ID":"18",
               "PUBLISHED_DATE":"Aug 13, 2020",
               "isFirstRecord":"true",
               "PAGE_CNT":"13",
               "MULTI_TICKER_IND_NAME":"",
               "PRODUCT_CATEGORY":""
            },
            {
               "SECTOR_DESC":"Property",
               "REPORT_TYPE_NAME":"Company Note",
               "REP_DESC":"Careful about quality and valuation of M&A targets - We hosted Times Neighborhood (TN) in post-results NDR calls on 13 Aug in which Chairman, CEO and CFO participated. Management looks hesitant to raise its guidance for GFA under management, despite the three M&amp;A deals TN completed in 7M20 which increased its GFA under management by 22m sq m (Fig 3). Management is still actively identifying targets in order to enrich TN&#8217;s portfolio but is well aware of their differing qualities and increasing valuations buoyed by active secondary markets. It is emphasisingoperational match and does not intend to complete any deals which could jeopardise the overall quality of TN&#8217;s portfolio.Reiterates EPS CAGR guidance over FY20-22F - TN delivered 76% yoy growth in core net profit in 1H20, partly driven by an increase in GFA under management (10m sq m in 1H20, see Fig 3) and partly by higher penetration of value-added services (VAS). Management reiterated its EPS CAGR target of 70% over FY20-22F without further revision to its GFA under management target. In our opinion, major acquisitions in the near term, if any, could lead to higher EPS growth in FY21F and FY22F, and re-rating of the share price.Committed to GPM improvement through FY21F - TN&#8217;s gross profit margin (GPM) increased by 1.5% pts yoy in 1H20. Management remains committed to improving TN&#8217;s GPM by ~1% pt p.a. in FY20-21F, by automation and streamlining operations.Urban redevelopment project services further explained - TN recorded a revenue of Rmb16.5m in 1H20 for providing services to Times China&#8217;s urban redevelopment pipeline as part of VAS to non-property owners. Traditional services, such as security and cleaning, accounted for ~30% of the sub-segment revenue and carried a GPM of ~20%. Tenant management, which accounted for ~70% of the sub-segment revenue, carried a higher GPM of ~30-40% as lower costs were involved.Reiterate Add; recent pullback offers a good entry point - We think the recent share price pullback (10% from historical high as of 13 Aug) offers a good entry point for investors to capture its high EPS CAGR over FY20-22F. Our TP of HK$19.5 is based on a PEG 0.6x over FY20-22F. Re-rating catalysts include major acquisitions, stronger-than-expected profit margin improvement and higher penetration of VAS. Key downside risks: slower delivery of completed properties by Times China (1233 HK, Add, CP HK$13.52) and a slowdown in China&#8217;s economy.",
               "ABOUT":"CIBC is partnering with Malaysian-headquartered CIMB to provide exclusive Canadian distribution for its Asian equity research. CIMB provides equity research across ten markets including Malaysia, Singapore, Indonesia, Thailand, Hong Kong/China, Taiwan, South Korea, India and Vietnam. Through joint ventures, CIMB also publishes equity research covering Philippines and Sri Lanka. Below is the latest daily publishing summary for CIMB reports. In the coming months, CIBC will provide entitled clients even more access to CIMB research.",
               "TARGET_NAME":"",
               "PRIMARY_TICKER_ID":"",
               "COMPANY_NAME":"",
               "REP_TYPE_TOOLTIP":"Company Note",
               "VENDOR_ID":"1122",
               "ICON":"BLUE",
               "REP_PUBLICATION_ID":"E7344683-046B-4792-B3EE-18844330E0D6",
               "TICKER":"",
               "MULTI_IND_NAME":"",
               "ANALYST_ID_LIST":"201848",
               "REP_TYPE_NAME":"Company Note",
               "REP_TITLE":"HK: Times Neighborhood - Takeaways from post-results NDR calls",
               "REP_ANALYST_ID":"201848",
               "REP_ANALYST_FULL_NAME":"Raymond Cheng",
               "LEGEND_IMG_PATH":"cibc/images/Company.gif",
               "REPORT_GROUP":"F",
               "REP_ANA_NAME":"Cheng",
               "INDUSTRY_ID":"",
               "IND_NAME":"",
               "SECTOR_ID":"427018",
               "ANALYST_LIST":[

               ],
               "MUL_TIC_MULTI_IND_SECTOR_NAME":"",
               "REP_TITLE_TOOLTIP":"HK: Times Neighborhood - Takeaways from post-results NDR calls",
               "MULTI_IND_MULTI_SECTOR":"",
               "REPORT_TYPE_ID":"18",
               "PUBLISHED_DATE":"Aug 13, 2020",
               "PAGE_CNT":"12",
               "MULTI_TICKER_IND_NAME":"",
               "PRODUCT_CATEGORY":""
            },
            {
               "SECTOR_DESC":"Technology",
               "REPORT_TYPE_NAME":"Company Flash Note",
               "REP_DESC":"Government to allow foreign worker re-employment scheme - The Ministry of Human Resources announced today that the government will allow employers to rehire foreign workers who have lost their jobs recently but are still residing in the country with a legal working permit within the same sector. To recap, the government implemented a hiring freeze on foreign workers in Malaysia since the start of the movement control order (MCO) in Mar and it will be in effect until the end of 2020. The hiring freeze for foreign workers is also part of the government&#8217;s initiative to contain the Covid-19 pandemic through travel restrictions for visitors into Malaysia.Employers are encouraged to ensure that the re-employed workers have already been tested for Covid-19 through the online database provided by the Department of Labour and MyEG. To recap, MyEG had recently started a data sharing collaboration with the Department of Labour for the purposes of monitoring and enforcement related to the Covid-19 screening of foreign workers.Potential for job-matching prospects for MyEG - Although the foreign worker hiring freeze had affected MyEG&#8217;s recruitment business given that we estimate MyEG processes between 3k-4k new recruits per month, we see the latest development of allowing the re-employment of foreign workers within the country as helping to reduce the impact from the hiring freeze.Moreover, MyEG&#8217;s foreign worker permit renewal business is not affected by the hiring freeze given that employers can still renew and extend their employees&#8217; permits. Meanwhile, the group indicated that the increase in online service market share transactions for Road Transport Department and Immigration-related services should offset the decline in recruitment service processes.In addition, we see potential for MyEG to leverage its one-stop Covid-19 portal, which is an alternative channel for employers to register and arrange for testing of their workers at a cost of RM150 per test. The group said it received favourable feedback from employers that had participated in the programme since its launch in early-Jun 20. We learnt that MyEG has approximately completed 100k Covid-19 tests booked through its portal. MyEG targets to carry out 500k Covid-19 test screenings in 2020F.Reiterate Add with RM1.80 TP - Reiterate Add and RM1.80 TP, based on 24x CY21F P/E, in line with its 5-year mean. We see potential award of contracts for the Visa Luar Negara and NIISe projects as re-rating catalysts for the stock, while delays in the e-government service concession and failure to secure e-visa and NIISe contracts are key downside risks to our call.",
               "ABOUT":"CIBC is partnering with Malaysian-headquartered CIMB to provide exclusive Canadian distribution for its Asian equity research. CIMB provides equity research across ten markets including Malaysia, Singapore, Indonesia, Thailand, Hong Kong/China, Taiwan, South Korea, India and Vietnam. Through joint ventures, CIMB also publishes equity research covering Philippines and Sri Lanka. Below is the latest daily publishing summary for CIMB reports. In the coming months, CIBC will provide entitled clients even more access to CIMB research.",
               "TARGET_NAME":"MYEG",
               "PRIMARY_TICKER_ID":"205520",
               "COMPANY_NAME":"MY E.G. Services",
               "REP_TYPE_TOOLTIP":"Company Flash Note",
               "VENDOR_ID":"1122",
               "ICON":"GREEN",
               "REP_PUBLICATION_ID":"6F19D60F-7CB7-452E-9B2C-3DA1D540884F",
               "TICKER":"MYEG",
               "MULTI_IND_NAME":"Technology",
               "ANALYST_ID_LIST":"201680",
               "REP_TYPE_NAME":"Company Flash Note",
               "REP_TITLE":"MY: MY E.G. Services - Freeze on foreign workers starts to thaw",
               "REP_ANALYST_ID":"201680",
               "REP_ANALYST_FULL_NAME":"Mohd Shanaz NOOR AZAM",
               "LEGEND_IMG_PATH":"equities-eportal/images/Intraday.gif",
               "REPORT_GROUP":"F",
               "REP_ANA_NAME":"NOOR AZAM",
               "INDUSTRY_ID":"",
               "IND_NAME":"",
               "SECTOR_ID":"427021",
               "ANALYST_LIST":[

               ],
               "MUL_TIC_MULTI_IND_SECTOR_NAME":"",
               "REP_TITLE_TOOLTIP":"MY: MY E.G. Services - Freeze on foreign workers starts to thaw",
               "MULTI_IND_MULTI_SECTOR":"",
               "REPORT_TYPE_ID":"15",
               "PUBLISHED_DATE":"Aug 13, 2020",
               "PAGE_CNT":"9",
               "MULTI_TICKER_IND_NAME":"",
               "PRODUCT_CATEGORY":""
            },
            {
               "SECTOR_DESC":"Automobiles and Parts",
               "REPORT_TYPE_NAME":"Company Note",
               "REP_DESC":"Magnitude of 1QFY3/21 net loss disappointing - Ashok&#8217;s EBITDA loss of Rs3.3bn was sharply higher than our (72%) and BB consensus (11%) numbers. The 15% beat in net sales was more than offset by its high fixed cost structure, leading to the EBITDA miss. Further, the more than doubling of its interest expenses qoq and lower other income led to a net loss to Rs3.9bn, some 5% short of consensus. Management indicated that net debt doubled qoq to Rs42.5bn, leading to a net D:E at 0.6x, as Rs12bn creditors were paid off in the quarter.Management conference call highlights - Management said it is seeing early signs of a demand revival in intermediate commercial vehicles (ICV) and tippers. Bus orders from state/central government agencies are taking longer than expected due to poor government agency finances. The company&#8217;s production facilities are operating at 35% capacity utilisation now. Management said the sharp spike in 1Q ASP was due to favourable non-commercial vehicle mix at 60% in 1Q, but this may not be sustainable. It also indicated that inter-corporate debt has eased by 20% qoq to Rs4bn. For Hinduja Leyland Finance, the moratorium proportion of loans has eased from a peak of 75%, to 40% now.Core EPS cut by 6-9% for FY22-23F - The poor fixed cost management due to Covid-19 restrictions in 1Q will be difficult to make up for in the rest of the year. Given the poor results in 1Q, we believe a PAT break-even is the best case scenario for FY21F, even with volume growth in 4QFY21F. We believe the reinstatement of truck volumes in 4Q will be crucial if it is to attain the double-digit EBITDA margins it enjoyed previously. For FY22-23F, we cut our EBITDA by around 3%, driven by a similar volume cut. However, the prolonged net debt level expectation of around Rs30bn for coming years, due to no clear visibility of divesting non-core businesses, leads to our 6-9% core EPS cut for FY22-23F.Maintain Hold rating - Even though forward P/BV valuation at -1 s.d. below mean is attractive, a prolonged trucksales downcycle, coupled with ballooning net debt are concerns. We reiterate our Hold rating with a marginally raised DCF-based TP as we roll forward. Poor government finances limiting any fiscal stimulus benefits for the bus or truck segments concerns us. Upside risk is new product success helping Ashok gain market share.",
               "ABOUT":"CIBC is partnering with Malaysian-headquartered CIMB to provide exclusive Canadian distribution for its Asian equity research. CIMB provides equity research across ten markets including Malaysia, Singapore, Indonesia, Thailand, Hong Kong/China, Taiwan, South Korea, India and Vietnam. Through joint ventures, CIMB also publishes equity research covering Philippines and Sri Lanka. Below is the latest daily publishing summary for CIMB reports. In the coming months, CIBC will provide entitled clients even more access to CIMB research.",
               "TARGET_NAME":"AL",
               "PRIMARY_TICKER_ID":"205079",
               "COMPANY_NAME":"Ashok Leyland",
               "REP_TYPE_TOOLTIP":"Company Note",
               "VENDOR_ID":"1122",
               "ICON":"BLUE",
               "REP_PUBLICATION_ID":"93AF0D08-369D-469F-B56C-20B35846FD7E",
               "TICKER":"AL",
               "MULTI_IND_NAME":"Automobiles and Parts",
               "ANALYST_ID_LIST":"201539",
               "REP_TYPE_NAME":"Company Note",
               "REP_TITLE":"IN: Ashok Leyland - Interest cost burden concerns",
               "REP_ANALYST_ID":"201539",
               "REP_ANALYST_FULL_NAME":"Pramod Amthe",
               "LEGEND_IMG_PATH":"cibc/images/Company.gif",
               "REPORT_GROUP":"F",
               "REP_ANA_NAME":"Amthe",
               "INDUSTRY_ID":"",
               "IND_NAME":"",
               "SECTOR_ID":"427001",
               "ANALYST_LIST":[

               ],
               "MUL_TIC_MULTI_IND_SECTOR_NAME":"",
               "REP_TITLE_TOOLTIP":"IN: Ashok Leyland - Interest cost burden concerns",
               "MULTI_IND_MULTI_SECTOR":"",
               "REPORT_TYPE_ID":"18",
               "PUBLISHED_DATE":"Aug 13, 2020",
               "PAGE_CNT":"15",
               "MULTI_TICKER_IND_NAME":"",
               "PRODUCT_CATEGORY":""
            },
            {
               "SECTOR_DESC":"Property",
               "REPORT_TYPE_NAME":"Company Note",
               "REP_DESC":"Key results highlights - SP Setia reported 1HFY20 core net loss (excluding RM146m impairment of completed inventories and RM7.5m forex gain) of RM40m vs. core net profit of RM84m in 1H19. The results were below our and Bloomberg consensus expectations due to weaker-than-expected revenue recognised. The impairment of completed inventories was largely from Setia Sky 88 in Johor and Setia Sky Vista in Penang. 1HFY20 revenue fell 53% yoy due to weaker sales at its property development unit (-76% yoy), as construction progress for all projects was stopped during the movement control order (MCO) period in 2Q20. As of end-Jun 2020, total unbilled sales stood at RM9.7bn vs. RM10.7bn as at end-Jun 2019.1H20 new sales at RM875m - SP Setia secured RM875m of new property sales in 1H20 vs. RM1.9bn in 1H19, with the majority of new sales coming from the central region (c.57%) of Malaysia. This made up only c.23% of its FY20 sales target of RM3.8bn. Around 80% of the new property sales came from local projects while the rest from international projects. As of 11 Aug 2020, the group secured RM1.45bn worth of new sales and had a booking pipeline of RM1.54bn as of Jul 2020. SP Setia will focus on fast conversion of these bookings into sales. Given the pick-up in sales momentum post-MCO and a good product mix skewed towards landed homes, we believe its FY20 sales target should be achievable.Fewer new launches and focus on inventory monetisation - Prior to the MCO, the group launched projects worth c.RM478m in gross development value. The group will roll out selective new launches focused on the mid-range landed units in established townships to cater to the demand from owner-occupiers. For FY20F, SP Setia revised down its new launch GDV from RM4.4bn to RM2.8bn and will focus on inventory monetisation, which could be due to cash flow management and inventory management, in our view.Reiterate Add - We cut our FY20-22 EPS by 16-33% to factor in the slower-than-expected billing and fewer new launches. Our TP is revised to RM0.94 following our earnings revision, still based on 0.3x FY21F P/BV (-2 s.d. from its 3-year mean P/BV). We are positive on SP Setia given: (i) its attractive valuation (&lt;0.3x FY21F P/BV, lower than its peer average of 0.4x), (ii) massive land bank to cater for changes in consumer preferences, and (iii) anticipated earnings improvement in FY20-22F. We see limited downside to its share price as the stock is currently trading at a trough valuation of &lt;0.3x P/BV since 2000.",
               "ABOUT":"CIBC is partnering with Malaysian-headquartered CIMB to provide exclusive Canadian distribution for its Asian equity research. CIMB provides equity research across ten markets including Malaysia, Singapore, Indonesia, Thailand, Hong Kong/China, Taiwan, South Korea, India and Vietnam. Through joint ventures, CIMB also publishes equity research covering Philippines and Sri Lanka. Below is the latest daily publishing summary for CIMB reports. In the coming months, CIBC will provide entitled clients even more access to CIMB research.",
               "isLastRecord":"true",
               "TARGET_NAME":"SPSB",
               "PRIMARY_TICKER_ID":"205534",
               "COMPANY_NAME":"SP Setia",
               "REP_TYPE_TOOLTIP":"Company Note",
               "VENDOR_ID":"1122",
               "ICON":"BLUE",
               "REP_PUBLICATION_ID":"0FEF8912-0F7B-41BE-BB43-738E25CEE6A4",
               "TICKER":"SPSB",
               "MULTI_IND_NAME":"Property",
               "ANALYST_ID_LIST":"",
               "REP_TYPE_NAME":"Company Note",
               "REP_TITLE":"MY: SP Setia - Earnings dented by MCO",
               "REP_ANALYST_ID":"",
               "REP_ANALYST_FULL_NAME":"",
               "LEGEND_IMG_PATH":"cibc/images/Company.gif",
               "REPORT_GROUP":"F",
               "REP_ANA_NAME":"",
               "INDUSTRY_ID":"",
               "IND_NAME":"",
               "SECTOR_ID":"427018",
               "ANALYST_LIST":[

               ],
               "MUL_TIC_MULTI_IND_SECTOR_NAME":"",
               "REP_TITLE_TOOLTIP":"MY: SP Setia - Earnings dented by MCO",
               "MULTI_IND_MULTI_SECTOR":"",
               "REPORT_TYPE_ID":"18",
               "PUBLISHED_DATE":"Aug 13, 2020",
               "PAGE_CNT":"11",
               "MULTI_TICKER_IND_NAME":"",
               "PRODUCT_CATEGORY":""
            }
         ],
         "TOTAL_COUNT":"5",
         "ADDITIONAL_DATA":{
            "LAST_UPDATED_DT_TM":"13/08/2020 09:00:09"
         }
      }
   },
   "HEADER_VALUE":{
      "TXN_PROCESS_DATE_TIME":"13/08/2020 13:00:09"
   }
}
